######################################################################################################
##########################21년 연령대별 요일별 시간대 생활인구 데이터 제작용 코드########################
######################################################################################################

m21lp<-read.csv('.../m21lp.csv',header=T,fileEncoding = "euc-kr")

#성별 변수 통합
a10m3<-m21lp$남성연령대_10_월요일시간대_3_생활인구_수 + m21lp$여성연령대_10_월요일시간대_3_생활인구_수
a10m4<-m21lp$남성연령대_10_월요일시간대_4_생활인구_수 + m21lp$여성연령대_10_월요일시간대_4_생활인구_수

a10t3<-m21lp$남성연령대_10_화요일시간대_3_생활인구_수 + m21lp$여성연령대_10_화요일시간대_3_생활인구_수
a10t4<-m21lp$남성연령대_10_화요일시간대_4_생활인구_수 + m21lp$여성연령대_10_화요일시간대_4_생활인구_수

a10w3<-m21lp$남성연령대_10_수요일시간대_3_생활인구_수 + m21lp$여성연령대_10_수요일시간대_3_생활인구_수
a10w4<-m21lp$남성연령대_10_수요일시간대_4_생활인구_수 + m21lp$여성연령대_10_수요일시간대_4_생활인구_수

a10h3<-m21lp$남성연령대_10_목요일시간대_3_생활인구_수 + m21lp$여성연령대_10_목요일시간대_3_생활인구_수
a10h4<-m21lp$남성연령대_10_목요일시간대_4_생활인구_수 + m21lp$여성연령대_10_목요일시간대_4_생활인구_수

a10f3<-m21lp$남성연령대_10_금요일시간대_3_생활인구_수 + m21lp$여성연령대_10_금요일시간대_3_생활인구_수
a10f4<-m21lp$남성연령대_10_금요일시간대_4_생활인구_수 + m21lp$여성연령대_10_금요일시간대_4_생활인구_수

a10s<-m21lp$남성연령대_10_토요일시간대_3_생활인구_수 + m21lp$여성연령대_10_토요일시간대_3_생활인구_수
a10su<-m21lp$남성연령대_10_일요일시간대_3_생활인구_수 + m21lp$여성연령대_10_일요일시간대_3_생활인구_수


a20m3<-m21lp$남성연령대_20_월요일시간대_3_생활인구_수 + m21lp$여성연령대_20_월요일시간대_3_생활인구_수
a20m4<-m21lp$남성연령대_20_월요일시간대_4_생활인구_수 + m21lp$여성연령대_20_월요일시간대_4_생활인구_수

a20t3<-m21lp$남성연령대_20_화요일시간대_3_생활인구_수 + m21lp$여성연령대_20_화요일시간대_3_생활인구_수
a20t4<-m21lp$남성연령대_20_화요일시간대_4_생활인구_수 + m21lp$여성연령대_20_화요일시간대_4_생활인구_수

a20w3<-m21lp$남성연령대_20_수요일시간대_3_생활인구_수 + m21lp$여성연령대_20_수요일시간대_3_생활인구_수
a20w4<-m21lp$남성연령대_20_수요일시간대_4_생활인구_수 + m21lp$여성연령대_20_수요일시간대_4_생활인구_수

a20h3<-m21lp$남성연령대_20_목요일시간대_3_생활인구_수 + m21lp$여성연령대_20_목요일시간대_3_생활인구_수
a20h4<-m21lp$남성연령대_20_목요일시간대_4_생활인구_수 + m21lp$여성연령대_20_목요일시간대_4_생활인구_수

a20f3<-m21lp$남성연령대_20_금요일시간대_3_생활인구_수 + m21lp$여성연령대_20_금요일시간대_3_생활인구_수
a20f4<-m21lp$남성연령대_20_금요일시간대_4_생활인구_수 + m21lp$여성연령대_20_금요일시간대_4_생활인구_수

a20s<-m21lp$남성연령대_20_토요일시간대_3_생활인구_수 + m21lp$여성연령대_20_토요일시간대_3_생활인구_수
a20su<-m21lp$남성연령대_20_일요일시간대_3_생활인구_수 + m21lp$여성연령대_20_일요일시간대_3_생활인구_수


a30m3<-m21lp$남성연령대_30_월요일시간대_3_생활인구_수 + m21lp$여성연령대_30_월요일시간대_3_생활인구_수
a30m4<-m21lp$남성연령대_30_월요일시간대_4_생활인구_수 + m21lp$여성연령대_30_월요일시간대_4_생활인구_수

a30t3<-m21lp$남성연령대_30_화요일시간대_3_생활인구_수 + m21lp$여성연령대_30_화요일시간대_3_생활인구_수
a30t4<-m21lp$남성연령대_30_화요일시간대_4_생활인구_수 + m21lp$여성연령대_30_화요일시간대_4_생활인구_수


a30w3<-m21lp$남성연령대_30_수요일시간대_3_생활인구_수 + m21lp$여성연령대_30_수요일시간대_3_생활인구_수
a30w4<-m21lp$남성연령대_30_수요일시간대_4_생활인구_수 + m21lp$여성연령대_30_수요일시간대_4_생활인구_수

a30h3<-m21lp$남성연령대_30_목요일시간대_3_생활인구_수 + m21lp$여성연령대_30_목요일시간대_3_생활인구_수
a30h4<-m21lp$남성연령대_30_목요일시간대_4_생활인구_수 + m21lp$여성연령대_30_목요일시간대_4_생활인구_수

a30f3<-m21lp$남성연령대_30_금요일시간대_3_생활인구_수 + m21lp$여성연령대_30_금요일시간대_3_생활인구_수
a30f4<-m21lp$남성연령대_30_금요일시간대_4_생활인구_수 + m21lp$여성연령대_30_금요일시간대_4_생활인구_수

a30s<-m21lp$남성연령대_30_토요일시간대_3_생활인구_수 + m21lp$여성연령대_30_토요일시간대_3_생활인구_수
a30su<-m21lp$남성연령대_30_일요일시간대_3_생활인구_수 + m21lp$여성연령대_30_일요일시간대_3_생활인구_수


a40m3<-m21lp$남성연령대_40_월요일시간대_3_생활인구_수 + m21lp$여성연령대_40_월요일시간대_3_생활인구_수
a40m4<-m21lp$남성연령대_40_월요일시간대_4_생활인구_수 + m21lp$여성연령대_40_월요일시간대_4_생활인구_수

a40t3<-m21lp$남성연령대_40_화요일시간대_3_생활인구_수 + m21lp$여성연령대_40_화요일시간대_3_생활인구_수
a40t4<-m21lp$남성연령대_40_화요일시간대_4_생활인구_수 + m21lp$여성연령대_40_화요일시간대_4_생활인구_수

a40w3<-m21lp$남성연령대_40_수요일시간대_3_생활인구_수 + m21lp$여성연령대_40_수요일시간대_3_생활인구_수
a40w4<-m21lp$남성연령대_40_수요일시간대_4_생활인구_수 + m21lp$여성연령대_40_수요일시간대_4_생활인구_수

a40h3<-m21lp$남성연령대_40_목요일시간대_3_생활인구_수 + m21lp$여성연령대_40_목요일시간대_3_생활인구_수
a40h4<-m21lp$남성연령대_40_목요일시간대_4_생활인구_수 + m21lp$여성연령대_40_목요일시간대_4_생활인구_수

a40f3<-m21lp$남성연령대_40_금요일시간대_3_생활인구_수 + m21lp$여성연령대_40_금요일시간대_3_생활인구_수
a40f4<-m21lp$남성연령대_40_금요일시간대_4_생활인구_수 + m21lp$여성연령대_40_금요일시간대_4_생활인구_수


a40s<-m21lp$남성연령대_40_토요일시간대_3_생활인구_수 + m21lp$여성연령대_40_토요일시간대_3_생활인구_수
a40su<-m21lp$남성연령대_40_일요일시간대_3_생활인구_수 + m21lp$여성연령대_40_일요일시간대_3_생활인구_수


a50m3<-m21lp$남성연령대_50_월요일시간대_3_생활인구_수 + m21lp$여성연령대_50_월요일시간대_3_생활인구_수
a50m4<-m21lp$남성연령대_50_월요일시간대_4_생활인구_수 + m21lp$여성연령대_50_월요일시간대_4_생활인구_수

a50t3<-m21lp$남성연령대_50_화요일시간대_3_생활인구_수 + m21lp$여성연령대_50_화요일시간대_3_생활인구_수
a50t4<-m21lp$남성연령대_50_화요일시간대_4_생활인구_수 + m21lp$여성연령대_50_화요일시간대_4_생활인구_수

a50w3<-m21lp$남성연령대_50_수요일시간대_3_생활인구_수 + m21lp$여성연령대_50_수요일시간대_3_생활인구_수
a50w4<-m21lp$남성연령대_50_수요일시간대_4_생활인구_수 + m21lp$여성연령대_50_수요일시간대_4_생활인구_수

a50h3<-m21lp$남성연령대_50_목요일시간대_3_생활인구_수 + m21lp$여성연령대_50_목요일시간대_3_생활인구_수
a50h4<-m21lp$남성연령대_50_목요일시간대_4_생활인구_수 + m21lp$여성연령대_50_목요일시간대_4_생활인구_수

a50f3<-m21lp$남성연령대_50_금요일시간대_3_생활인구_수 + m21lp$여성연령대_50_금요일시간대_3_생활인구_수
a50f4<-m21lp$남성연령대_50_금요일시간대_4_생활인구_수 + m21lp$여성연령대_50_금요일시간대_4_생활인구_수

a50s<-m21lp$남성연령대_50_토요일시간대_3_생활인구_수 + m21lp$여성연령대_50_토요일시간대_3_생활인구_수
a50su<-m21lp$남성연령대_50_일요일시간대_3_생활인구_수 + m21lp$여성연령대_50_일요일시간대_3_생활인구_수


a60m3<-m21lp$남성연령대_60_이상_월요일시간대_3_생활인구_수 + m21lp$여성연령대_60_이상_월요일시간대_3_생활인구_수
a60m4<-m21lp$남성연령대_60_이상_월요일시간대_4_생활인구_수 + m21lp$여성연령대_60_이상_월요일시간대_4_생활인구_수

a60t3<-m21lp$남성연령대_60_이상_화요일시간대_3_생활인구_수 + m21lp$여성연령대_60_이상_화요일시간대_3_생활인구_수
a60t4<-m21lp$남성연령대_60_이상_화요일시간대_4_생활인구_수 + m21lp$여성연령대_60_이상_화요일시간대_4_생활인구_수

a60w3<-m21lp$남성연령대_60_이상_수요일시간대_3_생활인구_수 + m21lp$여성연령대_60_이상_수요일시간대_3_생활인구_수
a60w4<-m21lp$남성연령대_60_이상_수요일시간대_4_생활인구_수 + m21lp$여성연령대_60_이상_수요일시간대_4_생활인구_수

a60h3<-m21lp$남성연령대_60_이상_목요일시간대_3_생활인구_수 + m21lp$여성연령대_60_이상_목요일시간대_3_생활인구_수
a60h4<-m21lp$남성연령대_60_이상_목요일시간대_4_생활인구_수 + m21lp$여성연령대_60_이상_목요일시간대_4_생활인구_수

a60f3<-m21lp$남성연령대_60_이상_금요일시간대_3_생활인구_수 + m21lp$여성연령대_60_이상_금요일시간대_3_생활인구_수
a60f4<-m21lp$남성연령대_60_이상_금요일시간대_4_생활인구_수 + m21lp$여성연령대_60_이상_금요일시간대_4_생활인구_수

a60s<-m21lp$남성연령대_60_이상_토요일시간대_3_생활인구_수 + m21lp$여성연령대_60_이상_토요일시간대_3_생활인구_수
a60su<-m21lp$남성연령대_60_이상_일요일시간대_3_생활인구_수 + m21lp$여성연령대_60_이상_일요일시간대_3_생활인구_수

m21lpe <- data.frame(m21lp$기준_분기_코드,m21lp$X.상권_구분_코드_명,m21lp$상권_코드,a10m3,a10m4,a10t3,a10t4,a10w3,a10w4,a10h3,a10w4,a10f3,a10f4,a10s,a10su,a20m3,a20m4,a20t3,a20t4,a20w3,a20w4,a20h3,a20w4,a20f3,a20f4,a20s,a20su,a30m3,a30m4,a30t3,a30t4,a30w3,a30w4,a30h3,a30w4,a30f3,a30f4,a30s,a30su,a40m3,a40m4,a40t3,a40t4,a40w3,a40w4,a40h3,a40w4,a40f3,a40f4,a40s,a40su,a50m3,a50m4,a50t3,a50t4,a50w3,a50w4,a50h3,a50w4,a50f3,a50f4,a50s,a50su,a60m3,a60m4,a60t3,a60t4,a60w3,a60w4,a60h3,a60w4,a60f3,a60f4,a60s,a60su)
write.csv(m21lpe,".../21년_연령대_요일_시간대_생활인구.csv",row.names=F, fileEncoding = 'cp949')