######################################################################################################
##########################21년 상권배후지의 연령대별 요일별 시간대 생활인구 데이터 제작용 코드############
######################################################################################################

md21lp<-read.csv('.../md21lp.csv',header=T,fileEncoding = "euc-kr")

a10m3<-md21lp$남성연령대_10_월요일시간대_3_생활인구_수 + md21lp$여성연령대_10_월요일시간대_3_생활인구_수
a10m4<-md21lp$남성연령대_10_월요일시간대_4_생활인구_수 + md21lp$여성연령대_10_월요일시간대_4_생활인구_수

a10t3<-md21lp$남성연령대_10_화요일시간대_3_생활인구_수 + md21lp$여성연령대_10_화요일시간대_3_생활인구_수
a10t4<-md21lp$남성연령대_10_화요일시간대_4_생활인구_수 + md21lp$여성연령대_10_화요일시간대_4_생활인구_수

a10w3<-md21lp$남성연령대_10_수요일시간대_3_생활인구_수 + md21lp$여성연령대_10_수요일시간대_3_생활인구_수
a10w4<-md21lp$남성연령대_10_수요일시간대_4_생활인구_수 + md21lp$여성연령대_10_수요일시간대_4_생활인구_수

a10h3<-md21lp$남성연령대_10_목요일시간대_3_생활인구_수 + md21lp$여성연령대_10_목요일시간대_3_생활인구_수
a10h4<-md21lp$남성연령대_10_목요일시간대_4_생활인구_수 + md21lp$여성연령대_10_목요일시간대_4_생활인구_수

a10f3<-md21lp$남성연령대_10_금요일시간대_3_생활인구_수 + md21lp$여성연령대_10_금요일시간대_3_생활인구_수
a10f4<-md21lp$남성연령대_10_금요일시간대_4_생활인구_수 + md21lp$여성연령대_10_금요일시간대_4_생활인구_수

a10s<-md21lp$남성연령대_10_토요일시간대_3_생활인구_수 + md21lp$여성연령대_10_토요일시간대_3_생활인구_수
a10su<-md21lp$남성연령대_10_일요일시간대_3_생활인구_수 + md21lp$여성연령대_10_일요일시간대_3_생활인구_수


a20m3<-md21lp$남성연령대_20_월요일시간대_3_생활인구_수 + md21lp$여성연령대_20_월요일시간대_3_생활인구_수
a20m4<-md21lp$남성연령대_20_월요일시간대_4_생활인구_수 + md21lp$여성연령대_20_월요일시간대_4_생활인구_수

a20t3<-md21lp$남성연령대_20_화요일시간대_3_생활인구_수 + md21lp$여성연령대_20_화요일시간대_3_생활인구_수
a20t4<-md21lp$남성연령대_20_화요일시간대_4_생활인구_수 + md21lp$여성연령대_20_화요일시간대_4_생활인구_수

a20w3<-md21lp$남성연령대_20_수요일시간대_3_생활인구_수 + md21lp$여성연령대_20_수요일시간대_3_생활인구_수
a20w4<-md21lp$남성연령대_20_수요일시간대_4_생활인구_수 + md21lp$여성연령대_20_수요일시간대_4_생활인구_수

a20h3<-md21lp$남성연령대_20_목요일시간대_3_생활인구_수 + md21lp$여성연령대_20_목요일시간대_3_생활인구_수
a20h4<-md21lp$남성연령대_20_목요일시간대_4_생활인구_수 + md21lp$여성연령대_20_목요일시간대_4_생활인구_수

a20f3<-md21lp$남성연령대_20_금요일시간대_3_생활인구_수 + md21lp$여성연령대_20_금요일시간대_3_생활인구_수
a20f4<-md21lp$남성연령대_20_금요일시간대_4_생활인구_수 + md21lp$여성연령대_20_금요일시간대_4_생활인구_수

a20s<-md21lp$남성연령대_20_토요일시간대_3_생활인구_수 + md21lp$여성연령대_20_토요일시간대_3_생활인구_수
a20su<-md21lp$남성연령대_20_일요일시간대_3_생활인구_수 + md21lp$여성연령대_20_일요일시간대_3_생활인구_수


a30m3<-md21lp$남성연령대_30_월요일시간대_3_생활인구_수 + md21lp$여성연령대_30_월요일시간대_3_생활인구_수
a30m4<-md21lp$남성연령대_30_월요일시간대_4_생활인구_수 + md21lp$여성연령대_30_월요일시간대_4_생활인구_수

a30t3<-md21lp$남성연령대_30_화요일시간대_3_생활인구_수 + md21lp$여성연령대_30_화요일시간대_3_생활인구_수
a30t4<-md21lp$남성연령대_30_화요일시간대_4_생활인구_수 + md21lp$여성연령대_30_화요일시간대_4_생활인구_수

a30w3<-md21lp$남성연령대_30_수요일시간대_3_생활인구_수 + md21lp$여성연령대_30_수요일시간대_3_생활인구_수
a30w4<-md21lp$남성연령대_30_수요일시간대_4_생활인구_수 + md21lp$여성연령대_30_수요일시간대_4_생활인구_수

a30h3<-md21lp$남성연령대_30_목요일시간대_3_생활인구_수 + md21lp$여성연령대_30_목요일시간대_3_생활인구_수
a30h4<-md21lp$남성연령대_30_목요일시간대_4_생활인구_수 + md21lp$여성연령대_30_목요일시간대_4_생활인구_수

a30f3<-md21lp$남성연령대_30_금요일시간대_3_생활인구_수 + md21lp$여성연령대_30_금요일시간대_3_생활인구_수
a30f4<-md21lp$남성연령대_30_금요일시간대_4_생활인구_수 + md21lp$여성연령대_30_금요일시간대_4_생활인구_수

a30s<-md21lp$남성연령대_30_토요일시간대_3_생활인구_수 + md21lp$여성연령대_30_토요일시간대_3_생활인구_수
a30su<-md21lp$남성연령대_30_일요일시간대_3_생활인구_수 + md21lp$여성연령대_30_일요일시간대_3_생활인구_수


a40m3<-md21lp$남성연령대_40_월요일시간대_3_생활인구_수 + md21lp$여성연령대_40_월요일시간대_3_생활인구_수
a40m4<-md21lp$남성연령대_40_월요일시간대_4_생활인구_수 + md21lp$여성연령대_40_월요일시간대_4_생활인구_수

a40t3<-md21lp$남성연령대_40_화요일시간대_3_생활인구_수 + md21lp$여성연령대_40_화요일시간대_3_생활인구_수
a40t4<-md21lp$남성연령대_40_화요일시간대_4_생활인구_수 + md21lp$여성연령대_40_화요일시간대_4_생활인구_수

a40w3<-md21lp$남성연령대_40_수요일시간대_3_생활인구_수 + md21lp$여성연령대_40_수요일시간대_3_생활인구_수
a40w4<-md21lp$남성연령대_40_수요일시간대_4_생활인구_수 + md21lp$여성연령대_40_수요일시간대_4_생활인구_수

a40h3<-md21lp$남성연령대_40_목요일시간대_3_생활인구_수 + md21lp$여성연령대_40_목요일시간대_3_생활인구_수
a40h4<-md21lp$남성연령대_40_목요일시간대_4_생활인구_수 + md21lp$여성연령대_40_목요일시간대_4_생활인구_수

a40f3<-md21lp$남성연령대_40_금요일시간대_3_생활인구_수 + md21lp$여성연령대_40_금요일시간대_3_생활인구_수
a40f4<-md21lp$남성연령대_40_금요일시간대_4_생활인구_수 + md21lp$여성연령대_40_금요일시간대_4_생활인구_수

a40s<-md21lp$남성연령대_40_토요일시간대_3_생활인구_수 + md21lp$여성연령대_40_토요일시간대_3_생활인구_수
a40su<-md21lp$남성연령대_40_일요일시간대_3_생활인구_수 + md21lp$여성연령대_40_일요일시간대_3_생활인구_수


a50m3<-md21lp$남성연령대_50_월요일시간대_3_생활인구_수 + md21lp$여성연령대_50_월요일시간대_3_생활인구_수
a50m4<-md21lp$남성연령대_50_월요일시간대_4_생활인구_수 + md21lp$여성연령대_50_월요일시간대_4_생활인구_수

a50t3<-md21lp$남성연령대_50_화요일시간대_3_생활인구_수 + md21lp$여성연령대_50_화요일시간대_3_생활인구_수
a50t4<-md21lp$남성연령대_50_화요일시간대_4_생활인구_수 + md21lp$여성연령대_50_화요일시간대_4_생활인구_수

a50w3<-md21lp$남성연령대_50_수요일시간대_3_생활인구_수 + md21lp$여성연령대_50_수요일시간대_3_생활인구_수
a50w4<-md21lp$남성연령대_50_수요일시간대_4_생활인구_수 + md21lp$여성연령대_50_수요일시간대_4_생활인구_수

a50h3<-md21lp$남성연령대_50_목요일시간대_3_생활인구_수 + md21lp$여성연령대_50_목요일시간대_3_생활인구_수
a50h4<-md21lp$남성연령대_50_목요일시간대_4_생활인구_수 + md21lp$여성연령대_50_목요일시간대_4_생활인구_수

a50f3<-md21lp$남성연령대_50_금요일시간대_3_생활인구_수 + md21lp$여성연령대_50_금요일시간대_3_생활인구_수
a50f4<-md21lp$남성연령대_50_금요일시간대_4_생활인구_수 + md21lp$여성연령대_50_금요일시간대_4_생활인구_수

a50s<-md21lp$남성연령대_50_토요일시간대_3_생활인구_수 + md21lp$여성연령대_50_토요일시간대_3_생활인구_수
a50su<-md21lp$남성연령대_50_일요일시간대_3_생활인구_수 + md21lp$여성연령대_50_일요일시간대_3_생활인구_수


a60m3<-md21lp$남성연령대_60_이상_월요일시간대_3_생활인구_수 + md21lp$여성연령대_60_이상_월요일시간대_3_생활인구_수
a60m4<-md21lp$남성연령대_60_이상_월요일시간대_4_생활인구_수 + md21lp$여성연령대_60_이상_월요일시간대_4_생활인구_수

a60t3<-md21lp$남성연령대_60_이상_화요일시간대_3_생활인구_수 + md21lp$여성연령대_60_이상_화요일시간대_3_생활인구_수
a60t4<-md21lp$남성연령대_60_이상_화요일시간대_4_생활인구_수 + md21lp$여성연령대_60_이상_화요일시간대_4_생활인구_수

a60w3<-md21lp$남성연령대_60_이상_수요일시간대_3_생활인구_수 + md21lp$여성연령대_60_이상_수요일시간대_3_생활인구_수
a60w4<-md21lp$남성연령대_60_이상_수요일시간대_4_생활인구_수 + md21lp$여성연령대_60_이상_수요일시간대_4_생활인구_수

a60h3<-md21lp$남성연령대_60_이상_목요일시간대_3_생활인구_수 + md21lp$여성연령대_60_이상_목요일시간대_3_생활인구_수
a60h4<-md21lp$남성연령대_60_이상_목요일시간대_4_생활인구_수 + md21lp$여성연령대_60_이상_목요일시간대_4_생활인구_수

a60f3<-md21lp$남성연령대_60_이상_금요일시간대_3_생활인구_수 + md21lp$여성연령대_60_이상_금요일시간대_3_생활인구_수
a60f4<-md21lp$남성연령대_60_이상_금요일시간대_4_생활인구_수 + md21lp$여성연령대_60_이상_금요일시간대_4_생활인구_수

a60s<-md21lp$남성연령대_60_이상_토요일시간대_3_생활인구_수 + md21lp$여성연령대_60_이상_토요일시간대_3_생활인구_수
a60su<-md21lp$남성연령대_60_이상_일요일시간대_3_생활인구_수 + md21lp$여성연령대_60_이상_일요일시간대_3_생활인구_수

md21lpe <- data.frame(md21lp$기준_분기_코드,md21lp$상권_구분_코드_명,md21lp$상권_코드,a10m3,a10m4,a10t3,a10t4,a10w3,a10w4,a10h3,a10w4,a10f3,a10f4,a10s,a10su,a20m3,a20m4,a20t3,a20t4,a20w3,a20w4,a20h3,a20w4,a20f3,a20f4,a20s,a20su,a30m3,a30m4,a30t3,a30t4,a30w3,a30w4,a30h3,a30w4,a30f3,a30f4,a30s,a30su,a40m3,a40m4,a40t3,a40t4,a40w3,a40w4,a40h3,a40w4,a40f3,a40f4,a40s,a40su,a50m3,a50m4,a50t3,a50t4,a50w3,a50w4,a50h3,a50w4,a50f3,a50f4,a50s,a50su,a60m3,a60m4,a60t3,a60t4,a60w3,a60w4,a60h3,a60w4,a60f3,a60f4,a60s,a60su)
write.csv(md21lpe,".../21년_상권배후_연령대_요일_시간대_생활인구.csv",row.names=F, fileEncoding = 'cp949')
