######################################################################################################
##########################20년 상권배후 유사점포 현황 데이터 제작용 코드################################
######################################################################################################

md20m<-read.csv('C:/Users/CountBall/Desktop/빅데이터 페스티벌/데이터/8월 5일 데이터/점포/md20m.csv',header=T,fileEncoding = "euc-kr")

md20m <- md20m[,c(1:6,10)]
sm20t <- aggregate(data=md20m,유사_업종_점포_수~기준_년_코드+기준_분기_코드+상권_코드,sum,na.rm=T)
write.csv(sm20t,"C:/Users/CountBall/Desktop/빅데이터 페스티벌/데이터/8월 5일 데이터/점포/20년_상권배후_유사점포.csv",row.names=F, fileEncoding = 'cp949')
